Repository: xiaocang/easydict_win32
Catalog: dotnet/src/Easydict.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, da_dk, de_de, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, ms_my, th_th, vi_vn, zh_cn, zh_tw

# AppName
source: Easydict
zh_cn: 易词典
zh_tw: 易詞典

source: Source Text
ar_sa: النص المصدر
da_dk: Kildetekst
de_de: Quelltext
fr_fr: Texte source
hi_in: मूल पाठ
id_id: Teks Sumber
it_it: Testo di origine
ja_jp: 原文
ko_kr: 원문
ms_my: Teks Sumber
th_th: ข้อความต้นฉบับ
vi_vn: Văn bản gốc
zh_cn: 原文
zh_tw: 原文

source: Translation Results
ar_sa: نتائج الترجمة
da_dk: Oversættelsesresultater
de_de: Übersetzungsergebnisse
fr_fr: Résultats de traduction
hi_in: अनुवाद परिणाम
id_id: Hasil Terjemahan
it_it: Risultati della traduzione
ja_jp: 翻訳結果
ko_kr: 번역 결과
ms_my: Hasil Terjemahan
th_th: ผลการแปล
vi_vn: Kết quả dịch
zh_cn: 翻译结果
zh_tw: 翻譯結果

# InputPlaceholder
source: Enter or paste text to translate...
ar_sa: أدخل أو الصق النص للترجمة...
da_dk: Indtast eller indsæt tekst til oversættelse...
de_de: Text zum Übersetzen eingeben oder einfügen...
fr_fr: Entrez ou collez le texte à traduire...
hi_in: अनुवाद के लिए पाठ दर्ज या पेस्ट करें...
id_id: Masukkan atau tempel teks untuk diterjemahkan...
it_it: Inserisci o incolla il testo da tradurre...
ja_jp: 翻訳するテキストを入力または貼り付け...
ko_kr: 번역할 텍스트를 입력하거나 붙여넣기...
ms_my: Masukkan atau tampal teks untuk diterjemah...
th_th: พิมพ์หรือวางข้อความที่ต้องการแปล...
vi_vn: Nhập hoặc dán văn bản cần dịch...
zh_cn: 输入或粘贴要翻译的文本...
zh_tw: 輸入或貼上要翻譯的文字...

# TranslationPlaceholder
source: Translation will appear here...
ar_sa: ستظهر الترجمة هنا...
da_dk: Oversættelsen vises her...
de_de: Übersetzung erscheint hier...
fr_fr: La traduction apparaîtra ici...
hi_in: अनुवाद यहाँ दिखाई देगा...
id_id: Terjemahan akan muncul di sini...
it_it: La traduzione apparirà qui...
ja_jp: 翻訳結果がここに表示されます...
ko_kr: 번역 결과가 여기에 표시됩니다...
ms_my: Terjemahan akan dipaparkan di sini...
th_th: ผลการแปลจะปรากฏที่นี่...
vi_vn: Kết quả dịch sẽ hiển thị ở đây...
zh_cn: 翻译结果将在这里显示...
zh_tw: 翻譯結果將在這裡顯示...

# SettingsTooltip
source: Settings
ar_sa: الإعدادات
da_dk: Indstillinger
de_de: Einstellungen
fr_fr: Paramètres
hi_in: सेटिंग्स
id_id: Pengaturan
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
ms_my: Tetapan
th_th: การตั้งค่า
vi_vn: Cài đặt
zh_cn: 设置
zh_tw: 設定

# TranslateTooltip
source: Translate
ar_sa: ترجمة
da_dk: Oversæt
de_de: Übersetzen
fr_fr: Traduire
hi_in: अनुवाद करें
id_id: Terjemahkan
it_it: Traduci
ja_jp: 翻訳
ko_kr: 번역
ms_my: Terjemah
th_th: แปล
vi_vn: Dịch
zh_cn: 翻译
zh_tw: 翻譯

# SwapLanguagesTooltip
source: Swap source and target languages
ar_sa: تبديل لغة المصدر والهدف
da_dk: Byt kilde- og målsprog
de_de: Quell- und Zielsprache tauschen
fr_fr: Échanger les langues source et cible
hi_in: स्रोत और लक्ष्य भाषा बदलें
id_id: Tukar bahasa sumber dan target
it_it: Scambia lingua di origine e di destinazione
ja_jp: 原文言語と翻訳先言語を入れ替える
ko_kr: 원본 언어와 대상 언어 바꾸기
ms_my: Tukar bahasa sumber dan sasaran
th_th: สลับภาษาต้นทางและปลายทาง
vi_vn: Hoán đổi ngôn ngữ nguồn và đích
zh_cn: 交换源语言和目标语言
zh_tw: 交換來源語言和目標語言

# SourceLanguageTooltip
source: Source Language
ar_sa: لغة المصدر
da_dk: Kildesprog
de_de: Quellsprache
fr_fr: Langue source
hi_in: स्रोत भाषा
id_id: Bahasa Sumber
it_it: Lingua di origine
ja_jp: 原文言語
ko_kr: 원본 언어
ms_my: Bahasa Sumber
th_th: ภาษาต้นทาง
vi_vn: Ngôn ngữ nguồn
zh_cn: 源语言
zh_tw: 來源語言

# TargetLanguageTooltip
source: Target Language
ar_sa: لغة الهدف
da_dk: Målsprog
de_de: Zielsprache
fr_fr: Langue cible
hi_in: लक्ष्य भाषा
id_id: Bahasa Target
it_it: Lingua di destinazione
ja_jp: 翻訳先言語
ko_kr: 대상 언어
ms_my: Bahasa Sasaran
th_th: ภาษาปลายทาง
vi_vn: Ngôn ngữ đích
zh_cn: 目标语言。选择与源语言相同会进入纠错；选择其他目标语言会回到翻译。
zh_tw: 目標語言

# StatusConnected
source: Connected
ar_sa: متصل
da_dk: Forbundet
de_de: Verbunden
fr_fr: Connecté
hi_in: कनेक्टेड
id_id: Terhubung
it_it: Connesso
ja_jp: 接続済み
ko_kr: 연결됨
ms_my: Disambungkan
th_th: เชื่อมต่อแล้ว
vi_vn: Đã kết nối
zh_cn: 已连接
zh_tw: 已連線

# StatusDisconnected
source: Disconnected
ar_sa: غير متصل
da_dk: Afbrudt
de_de: Getrennt
fr_fr: Déconnecté
hi_in: डिस्कनेक्टेड
id_id: Terputus
it_it: Disconnesso
ja_jp: 切断
ko_kr: 연결 끊김
ms_my: Terputus
th_th: ไม่ได้เชื่อมต่อ
vi_vn: Ngắt kết nối
zh_cn: 未连接
zh_tw: 未連線

# StatusInitializing
source: Initializing...
ar_sa: جارٍ التهيئة...
da_dk: Initialiserer...
de_de: Initialisierung...
fr_fr: Initialisation...
hi_in: आरंभ हो रहा है...
id_id: Menginisialisasi...
it_it: Inizializzazione...
ja_jp: 初期化中...
ko_kr: 초기화 중...
ms_my: Memulakan...
th_th: กำลังเริ่มต้น...
vi_vn: Đang khởi tạo...
zh_cn: 初始化中...
zh_tw: 正在初始化...

# StatusReady
source: Ready
ar_sa: جاهز
da_dk: Klar
de_de: Bereit
fr_fr: Prêt
hi_in: तैयार
id_id: Siap
it_it: Pronto
ja_jp: 準備完了
ko_kr: 준비됨
ms_my: Sedia
th_th: พร้อม
vi_vn: Sẵn sàng
zh_cn: 就绪
zh_tw: 就緒

# StatusTranslating
source: Translating...
ar_sa: جارٍ الترجمة...
da_dk: Oversætter...
de_de: Übersetze...
fr_fr: Traduction en cours...
hi_in: अनुवाद हो रहा है...
id_id: Menerjemahkan...
it_it: Traduzione in corso...
ja_jp: 翻訳中...
ko_kr: 번역 중...
ms_my: Menterjemah...
th_th: กำลังแปล...
vi_vn: Đang dịch...
zh_cn: 翻译中...
zh_tw: 翻譯中...

# StatusError
source: Error
ar_sa: خطأ
da_dk: Fejl
de_de: Fehler
fr_fr: Erreur
hi_in: त्रुटि
id_id: Kesalahan
it_it: Errore
ja_jp: エラー
ko_kr: 오류
ms_my: Ralat
th_th: ข้อผิดพลาด
vi_vn: Lỗi
zh_cn: 错误
zh_tw: 錯誤

# LangAutoDetect
source: Auto Detect
ar_sa: اكتشاف تلقائي
da_dk: Automatisk registrering
de_de: Automatisch erkennen
fr_fr: Détection automatique
hi_in: स्वतः पहचान
id_id: Deteksi Otomatis
it_it: Rilevamento automatico
ja_jp: 自動検出
ko_kr: 자동 감지
ms_my: Kesan Automatik
th_th: ตรวจจับอัตโนมัติ
vi_vn: Tự động phát hiện
zh_cn: 自动检测
zh_tw: 自動偵測

# LangEnglish
source: English
ar_sa: الإنجليزية
da_dk: Engelsk
de_de: Englisch
fr_fr: Anglais
hi_in: अंग्रेज़ी
id_id: Inggris
it_it: Inglese
ja_jp: 英語
ko_kr: 영어
ms_my: Inggeris
th_th: อังกฤษ
vi_vn: Tiếng Anh
zh_cn: 英语
zh_tw: 英語

# LangChinese
source: Chinese
ar_sa: الصينية
da_dk: Kinesisk
de_de: Chinesisch
fr_fr: Chinois
hi_in: चीनी
id_id: Tionghoa
it_it: Cinese
ja_jp: 中国語
ko_kr: 중국어
ms_my: Cina
th_th: จีน
vi_vn: Tiếng Trung
zh_cn: 中文
zh_tw: 中文

# LangChineseSimplified
source: Chinese (Simplified)
ar_sa: الصينية (المبسّطة)
da_dk: Kinesisk (forenklet)
de_de: Chinesisch (Vereinfacht)
fr_fr: Chinois (simplifié)
hi_in: चीनी (सरलीकृत)
id_id: Tionghoa (Sederhana)
it_it: Cinese (Semplificato)
ja_jp: 中国語（簡体字）
ko_kr: 중국어(간체)
ms_my: Cina (Ringkas)
th_th: จีน (ตัวย่อ)
vi_vn: Tiếng Trung (Giản thể)
zh_cn: 简体中文
zh_tw: 簡體中文

# LangChineseTraditional
source: Chinese (Traditional)
ar_sa: الصينية (التقليدية)
da_dk: Kinesisk (traditionelt)
de_de: Chinesisch (Traditionell)
fr_fr: Chinois (traditionnel)
hi_in: चीनी (पारंपरिक)
id_id: Tionghoa (Tradisional)
it_it: Cinese (Tradizionale)
ja_jp: 中国語（繁体字）
ko_kr: 중국어(번체)
ms_my: Cina (Tradisional)
th_th: จีน (ตัวเต็ม)
vi_vn: Tiếng Trung (Phồn thể)
zh_cn: 繁体中文
zh_tw: 繁體中文

# LangJapanese
source: Japanese
ar_sa: اليابانية
da_dk: Japansk
de_de: Japanisch
fr_fr: Japonais
hi_in: जापानी
id_id: Jepang
it_it: Giapponese
ja_jp: 日本語
ko_kr: 일본어
ms_my: Jepun
th_th: ญี่ปุ่น
vi_vn: Tiếng Nhật
zh_cn: 日语
zh_tw: 日語

# LangKorean
source: Korean
ar_sa: الكورية
da_dk: Koreansk
de_de: Koreanisch
fr_fr: Coréen
hi_in: कोरियाई
id_id: Korea
it_it: Coreano
ja_jp: 韓国語
ko_kr: 한국어
ms_my: Korea
th_th: เกาหลี
vi_vn: Tiếng Hàn
zh_cn: 韩语
zh_tw: 韓語

# LangFrench
source: French
ar_sa: الفرنسية
da_dk: Fransk
de_de: Französisch
fr_fr: Français
hi_in: फ़्रेंच
id_id: Prancis
it_it: Francese
ja_jp: フランス語
ko_kr: 프랑스어
ms_my: Perancis
th_th: ฝรั่งเศส
vi_vn: Tiếng Pháp
zh_cn: 法语
zh_tw: 法語

# LangGerman
source: German
ar_sa: الألمانية
da_dk: Tysk
de_de: Deutsch
fr_fr: Allemand
hi_in: जर्मन
id_id: Jerman
it_it: Tedesco
ja_jp: ドイツ語
ko_kr: 독일어
ms_my: Jerman
th_th: เยอรมัน
vi_vn: Tiếng Đức
zh_cn: 德语
zh_tw: 德語

# LangSpanish
source: Spanish
ar_sa: الإسبانية
da_dk: Spansk
de_de: Spanisch
fr_fr: Espagnol
hi_in: स्पेनिश
id_id: Spanyol
it_it: Spagnolo
ja_jp: スペイン語
ko_kr: 스페인어
ms_my: Sepanyol
th_th: สเปน
vi_vn: Tiếng Tây Ban Nha
zh_cn: 西班牙语
zh_tw: 西班牙語

# LangClassicalChinese
source: Classical Chinese
de_de: Klassisches Chinesisch
fr_fr: Chinois classique
ja_jp: 漢文
ko_kr: 한문
zh_cn: 文言文
zh_tw: 文言文

# LangDutch
source: Dutch
de_de: Niederländisch
fr_fr: Néerlandais
ja_jp: オランダ語
ko_kr: 네덜란드어
zh_cn: 荷兰语
zh_tw: 荷蘭語

# LangSwedish
source: Swedish
de_de: Schwedisch
fr_fr: Suédois
ja_jp: スウェーデン語
ko_kr: 스웨덴어
zh_cn: 瑞典语
zh_tw: 瑞典語

# LangNorwegian
source: Norwegian
de_de: Norwegisch
fr_fr: Norvégien
ja_jp: ノルウェー語
ko_kr: 노르웨이어
zh_cn: 挪威语
zh_tw: 挪威語

# LangDanish
source: Danish
de_de: Dänisch
fr_fr: Danois
ja_jp: デンマーク語
ko_kr: 덴마크어
zh_cn: 丹麦语
zh_tw: 丹麥語

# LangPortuguese
source: Portuguese
de_de: Portugiesisch
fr_fr: Portugais
ja_jp: ポルトガル語
ko_kr: 포르투갈어
zh_cn: 葡萄牙语
zh_tw: 葡萄牙語

# LangItalian
source: Italian
de_de: Italienisch
fr_fr: Italien
ja_jp: イタリア語
ko_kr: 이탈리아어
zh_cn: 意大利语
zh_tw: 義大利語

# LangRomanian
source: Romanian
de_de: Rumänisch
fr_fr: Roumain
ja_jp: ルーマニア語
ko_kr: 루마니아어
zh_cn: 罗马尼亚语
zh_tw: 羅馬尼亞語

# LangRussian
source: Russian
de_de: Russisch
fr_fr: Russe
ja_jp: ロシア語
ko_kr: 러시아어
zh_cn: 俄语
zh_tw: 俄語

# LangPolish
source: Polish
de_de: Polnisch
fr_fr: Polonais
ja_jp: ポーランド語
ko_kr: 폴란드어
zh_cn: 波兰语
zh_tw: 波蘭語

# LangCzech
source: Czech
de_de: Tschechisch
fr_fr: Tchèque
ja_jp: チェコ語
ko_kr: 체코어
zh_cn: 捷克语
zh_tw: 捷克語

# LangUkrainian
source: Ukrainian
de_de: Ukrainisch
fr_fr: Ukrainien
ja_jp: ウクライナ語
ko_kr: 우크라이나어
zh_cn: 乌克兰语
zh_tw: 烏克蘭語

# LangBulgarian
source: Bulgarian
de_de: Bulgarisch
fr_fr: Bulgare
ja_jp: ブルガリア語
ko_kr: 불가리아어
zh_cn: 保加利亚语
zh_tw: 保加利亞語

# LangSlovak
source: Slovak
de_de: Slowakisch
fr_fr: Slovaque
ja_jp: スロバキア語
ko_kr: 슬로바키아어
zh_cn: 斯洛伐克语
zh_tw: 斯洛伐克語

# LangSlovenian
source: Slovenian
de_de: Slowenisch
fr_fr: Slovène
ja_jp: スロベニア語
ko_kr: 슬로베니아어
zh_cn: 斯洛文尼亚语
zh_tw: 斯洛維尼亞語

# LangEstonian
source: Estonian
de_de: Estnisch
fr_fr: Estonien
ja_jp: エストニア語
ko_kr: 에스토니아어
zh_cn: 爱沙尼亚语
zh_tw: 愛沙尼亞語

# LangLatvian
source: Latvian
de_de: Lettisch
fr_fr: Letton
ja_jp: ラトビア語
ko_kr: 라트비아어
zh_cn: 拉脱维亚语
zh_tw: 拉脫維亞語

# LangLithuanian
source: Lithuanian
de_de: Litauisch
fr_fr: Lituanien
ja_jp: リトアニア語
ko_kr: 리투아니아어
zh_cn: 立陶宛语
zh_tw: 立陶宛語

# LangGreek
source: Greek
de_de: Griechisch
fr_fr: Grec
ja_jp: ギリシャ語
ko_kr: 그리스어
zh_cn: 希腊语
zh_tw: 希臘語

# LangHungarian
source: Hungarian
de_de: Ungarisch
fr_fr: Hongrois
ja_jp: ハンガリー語
ko_kr: 헝가리어
zh_cn: 匈牙利语
zh_tw: 匈牙利語

# LangFinnish
source: Finnish
de_de: Finnisch
fr_fr: Finnois
ja_jp: フィンランド語
ko_kr: 핀란드어
zh_cn: 芬兰语
zh_tw: 芬蘭語

# LangTurkish
source: Turkish
de_de: Türkisch
fr_fr: Turc
ja_jp: トルコ語
ko_kr: 터키어
zh_cn: 土耳其语
zh_tw: 土耳其語

# LangArabic
source: Arabic
de_de: Arabisch
fr_fr: Arabe
ja_jp: アラビア語
ko_kr: 아랍어
zh_cn: 阿拉伯语
zh_tw: 阿拉伯語

# LangPersian
source: Persian
de_de: Persisch
fr_fr: Persan
ja_jp: ペルシア語
ko_kr: 페르시아어
zh_cn: 波斯语
zh_tw: 波斯語

# LangHebrew
source: Hebrew
de_de: Hebräisch
fr_fr: Hébreu
ja_jp: ヘブライ語
ko_kr: 히브리어
zh_cn: 希伯来语
zh_tw: 希伯來語

# LangHindi
source: Hindi
ja_jp: ヒンディー語
ko_kr: 힌디어
zh_cn: 印地语
zh_tw: 印地語

# LangBengali
source: Bengali
de_de: Bengalisch
ja_jp: ベンガル語
ko_kr: 벵골어
zh_cn: 孟加拉语
zh_tw: 孟加拉語

# LangTamil
source: Tamil
fr_fr: Tamoul
ja_jp: タミル語
ko_kr: 타밀어
zh_cn: 泰米尔语
zh_tw: 泰米爾語

# LangTelugu
source: Telugu
fr_fr: Télougou
ja_jp: テルグ語
ko_kr: 텔루구어
zh_cn: 泰卢固语
zh_tw: 泰盧固語

# LangUrdu
source: Urdu
fr_fr: Ourdou
ja_jp: ウルドゥー語
ko_kr: 우르두어
zh_cn: 乌尔都语
zh_tw: 烏爾都語

# LangVietnamese
source: Vietnamese
de_de: Vietnamesisch
fr_fr: Vietnamien
ja_jp: ベトナム語
ko_kr: 베트남어
zh_cn: 越南语
zh_tw: 越南語

# LangThai
source: Thai
de_de: Thailändisch
fr_fr: Thaï
ja_jp: タイ語
ko_kr: 태국어
zh_cn: 泰语
zh_tw: 泰語

# LangIndonesian
source: Indonesian
de_de: Indonesisch
fr_fr: Indonésien
ja_jp: インドネシア語
ko_kr: 인도네시아어
zh_cn: 印尼语
zh_tw: 印尼語

# LangMalay
source: Malay
de_de: Malaiisch
fr_fr: Malais
ja_jp: マレー語
ko_kr: 말레이어
zh_cn: 马来语
zh_tw: 馬來語

# LangFilipino
source: Filipino
ja_jp: フィリピン語
ko_kr: 필리핀어
zh_cn: 菲律宾语
zh_tw: 菲律賓語

source: Available Languages
de_de: Verfügbare Sprachen
fr_fr: Langues disponibles
ja_jp: 使用可能な言語
ko_kr: 사용 가능한 언어
zh_cn: 可用语言
zh_tw: 可用語言

# AvailableLanguagesDesc
source: Select languages available in source/target pickers. At least 2 required.
de_de: Wählen Sie die in den Quell-/Zielsprachauswahlfeldern verfügbaren Sprachen. Mindestens 2 erforderlich.
fr_fr: Sélectionnez les langues disponibles dans les sélecteurs source/cible. Au moins 2 requises.
ja_jp: ソース言語/ターゲット言語ピッカーで使用可能な言語を選択してください。最低2つ必要です。
ko_kr: 소스 언어/대상 언어 선택기에서 사용할 수 있는 언어를 선택하세요. 최소 2개 필요합니다.
zh_cn: 选择在源语言/目标语言选择器中可用的语言。至少需要选择2种语言。
zh_tw: 選擇在來源語言/目標語言選擇器中可用的語言。至少需要選擇2種語言。

source: Settings
ar_sa: الإعدادات
da_dk: Indstillinger
de_de: Einstellungen
fr_fr: Paramètres
hi_in: सेटिंग्स
id_id: Pengaturan
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
ms_my: Tetapan
th_th: การตั้งค่า
vi_vn: Cài đặt
zh_cn: 设置
zh_tw: 設定

source: Translation Service
ar_sa: خدمة الترجمة
da_dk: Oversættelsestjeneste
de_de: Übersetzungsdienst
fr_fr: Service de traduction
hi_in: अनुवाद सेवा
id_id: Layanan Terjemahan
it_it: Servizio di traduzione
ja_jp: 翻訳サービス
ko_kr: 번역 서비스
ms_my: Perkhidmatan Terjemahan
th_th: บริการแปลภาษา
vi_vn: Dịch vụ dịch thuật
zh_cn: 翻译服务
zh_tw: 翻譯服務

source: Enabled Services
ar_sa: الخدمات المفعّلة
da_dk: Aktiverede tjenester
de_de: Aktivierte Dienste
fr_fr: Services activés
hi_in: सक्रिय सेवाएँ
id_id: Layanan yang Diaktifkan
it_it: Servizi abilitati
ja_jp: 有効なサービス
ko_kr: 활성화된 서비스
ms_my: Perkhidmatan Diaktifkan
th_th: บริการที่เปิดใช้งาน
vi_vn: Dịch vụ đã bật
zh_cn: 已启用的服务
zh_tw: 已啟用的服務

# EnabledServicesDescription
source: Select which translation services to display in each window. Multiple services will run in parallel.
ar_sa: اختر خدمات الترجمة التي تريد عرضها في كل نافذة. ستعمل الخدمات المتعددة بشكل متوازٍ.
da_dk: Vælg hvilke oversættelsestjenester der skal vises i hvert vindue. Flere tjenester kører parallelt.
de_de: Wählen Sie aus, welche Übersetzungsdienste in jedem Fenster angezeigt werden. Mehrere Dienste werden parallel ausgeführt.
fr_fr: Sélectionnez les services de traduction à afficher dans chaque fenêtre. Plusieurs services s'exécuteront en parallèle.
hi_in: प्रत्येक विंडो में दिखाने के लिए अनुवाद सेवाएँ चुनें। कई सेवाएँ समानांतर में चलेंगी।
id_id: Pilih layanan terjemahan yang akan ditampilkan di setiap jendela. Beberapa layanan akan berjalan secara paralel.
it_it: Seleziona i servizi di traduzione da visualizzare in ogni finestra. Più servizi verranno eseguiti in parallelo.
ja_jp: 各ウィンドウに表示する翻訳サービスを選択します。複数のサービスは並行して実行されます。
ko_kr: 각 창에 표시할 번역 서비스를 선택하세요. 여러 서비스가 병렬로 실행됩니다.
ms_my: Pilih perkhidmatan terjemahan untuk dipaparkan dalam setiap tetingkap. Pelbagai perkhidmatan akan berjalan secara selari.
th_th: เลือกบริการแปลภาษาที่จะแสดงในแต่ละหน้าต่าง บริการหลายรายการจะทำงานพร้อมกัน
vi_vn: Chọn dịch vụ dịch thuật hiển thị trong mỗi cửa sổ. Nhiều dịch vụ sẽ chạy song song.
zh_cn: 选择在每个窗口中显示哪些翻译服务。多个服务将并行运行。
zh_tw: 選擇在每個視窗中顯示哪些翻譯服務。多個服務將並行運行。

source: Main Window
ar_sa: النافذة الرئيسية
da_dk: Hovedvindue
de_de: Hauptfenster
fr_fr: Fenêtre principale
hi_in: मुख्य विंडो
id_id: Jendela Utama
it_it: Finestra principale
ja_jp: メインウィンドウ
ko_kr: 메인 창
ms_my: Tetingkap Utama
th_th: หน้าต่างหลัก
vi_vn: Cửa sổ chính
zh_cn: 主窗口
zh_tw: 主視窗

source: Mini Window
ar_sa: النافذة المصغّرة
da_dk: Minivindue
de_de: Mini-Fenster
fr_fr: Mini fenêtre
hi_in: मिनी विंडो
id_id: Jendela Mini
it_it: Finestra mini
ja_jp: ミニウィンドウ
ko_kr: 미니 창
ms_my: Tetingkap Mini
th_th: หน้าต่างขนาดเล็ก
vi_vn: Cửa sổ nhỏ
zh_cn: 迷你窗口
zh_tw: 迷你視窗

source: Fixed Window
ar_sa: النافذة الثابتة
da_dk: Fast vindue
de_de: Fixiertes Fenster
fr_fr: Fenêtre fixe
hi_in: स्थिर विंडो
id_id: Jendela Tetap
it_it: Finestra fissa
ja_jp: 固定ウィンドウ
ko_kr: 고정 창
ms_my: Tetingkap Tetap
th_th: หน้าต่างคงที่
vi_vn: Cửa sổ cố định
zh_cn: 固定窗口
zh_tw: 固定視窗

source: Auto
ar_sa: تلقائي
da_dk: Automatisk
de_de: Automatisch
hi_in: स्वचालित
id_id: Otomatis
it_it: Automatico
ja_jp: 自動
ko_kr: 자동
ms_my: Automatik
th_th: อัตโนมัติ
vi_vn: Tự động
zh_cn: 自动
zh_tw: 自動

source: Manual
ar_sa: يدوي
da_dk: Manuel
de_de: Manuell
fr_fr: Manuel
hi_in: मैनुअल
it_it: Manuale
ja_jp: 手動
ko_kr: 수동
th_th: กำหนดเอง
vi_vn: Thủ công
zh_cn: 手动
zh_tw: 手動

source: Language Preferences
ar_sa: تفضيلات اللغة
da_dk: Sprogpræferencer
de_de: Spracheinstellungen
fr_fr: Préférences linguistiques
hi_in: भाषा प्राथमिकताएँ
id_id: Preferensi Bahasa
it_it: Preferenze lingua
ja_jp: 言語設定
ko_kr: 언어 기본 설정
ms_my: Keutamaan Bahasa
th_th: การตั้งค่าภาษา
vi_vn: Tùy chọn ngôn ngữ
zh_cn: 语言偏好
zh_tw: 語言偏好

source: First Language
ar_sa: اللغة الأولى
da_dk: Første sprog
de_de: Erste Sprache
fr_fr: Première langue
hi_in: प्रथम भाषा
id_id: Bahasa Pertama
it_it: Prima lingua
ja_jp: 第一言語
ko_kr: 제1 언어
ms_my: Bahasa Pertama
th_th: ภาษาที่หนึ่ง
vi_vn: Ngôn ngữ thứ nhất
zh_cn: 第一语言
zh_tw: 第一語言

source: Second Language
ar_sa: اللغة الثانية
da_dk: Andet sprog
de_de: Zweite Sprache
fr_fr: Deuxième langue
hi_in: द्वितीय भाषा
id_id: Bahasa Kedua
it_it: Seconda lingua
ja_jp: 第二言語
ko_kr: 제2 언어
ms_my: Bahasa Kedua
th_th: ภาษาที่สอง
vi_vn: Ngôn ngữ thứ hai
zh_cn: 第二语言
zh_tw: 第二語言

# LanguagePreferencesDescription
source: When detected language matches your First Language, translation target will be your Second Language, and vice versa.
ar_sa: عندما تتطابق اللغة المكتشفة مع لغتك الأولى، سيكون هدف الترجمة هو لغتك الثانية، والعكس صحيح.
da_dk: Når det registrerede sprog matcher dit Første sprog, vil oversættelsesmålet være dit Andet sprog og omvendt.
de_de: Wenn die erkannte Sprache Ihrer Ersten Sprache entspricht, wird die Übersetzung in Ihre Zweite Sprache erfolgen und umgekehrt.
fr_fr: Lorsque la langue détectée correspond à votre première langue, la cible de traduction sera votre deuxième langue, et vice versa.
hi_in: जब पहचानी गई भाषा आपकी प्रथम भाषा से मेल खाती है, तो अनुवाद लक्ष्य आपकी द्वितीय भाषा होगी, और इसके विपरीत।
id_id: Ketika bahasa yang terdeteksi cocok dengan Bahasa Pertama Anda, target terjemahan akan menjadi Bahasa Kedua, dan sebaliknya.
it_it: Quando la lingua rilevata corrisponde alla Prima lingua, l'obiettivo della traduzione sarà la Seconda lingua e viceversa.
ja_jp: 検出された言語が第一言語と一致する場合、翻訳先は第二言語になります。逆も同様です。
ko_kr: 감지된 언어가 제1 언어와 일치하면 번역 대상은 제2 언어가 됩니다. 그 반대도 마찬가지입니다.
ms_my: Apabila bahasa yang dikesan sepadan dengan Bahasa Pertama anda, sasaran terjemahan akan menjadi Bahasa Kedua, dan sebaliknya.
th_th: เมื่อภาษาที่ตรวจพบตรงกับภาษาที่หนึ่ง เป้าหมายการแปลจะเป็นภาษาที่สอง และในทางกลับกัน
vi_vn: Khi ngôn ngữ phát hiện trùng với Ngôn ngữ thứ nhất, mục tiêu dịch sẽ là Ngôn ngữ thứ hai và ngược lại.
zh_cn: 当检测到的语言与您的第一语言匹配时，翻译目标将是您的第二语言，反之亦然。
zh_tw: 當偵測到的語言與您的第一語言匹配時，翻譯目標將是您的第二語言，反之亦然。

# AutoSelectTargetLanguage
source: Automatically select target language based on detected source
ar_sa: تحديد لغة الهدف تلقائياً بناءً على لغة المصدر المكتشفة
da_dk: Vælg automatisk målsprog baseret på registreret kildesprog
de_de: Zielsprache automatisch basierend auf erkannter Quelle auswählen
fr_fr: Sélectionner automatiquement la langue cible selon la source détectée
hi_in: पहचानी गई स्रोत भाषा के आधार पर लक्ष्य भाषा स्वचालित रूप से चुनें
id_id: Pilih bahasa target secara otomatis berdasarkan bahasa sumber yang terdeteksi
it_it: Seleziona automaticamente la lingua di destinazione in base alla lingua di origine rilevata
ja_jp: 検出された原文言語に基づいて翻訳先言語を自動選択
ko_kr: 감지된 원본 언어에 따라 대상 언어 자동 선택
ms_my: Pilih bahasa sasaran secara automatik berdasarkan bahasa sumber yang dikesan
th_th: เลือกภาษาปลายทางอัตโนมัติตามภาษาต้นทางที่ตรวจพบ
vi_vn: Tự động chọn ngôn ngữ đích dựa trên ngôn ngữ nguồn phát hiện được
zh_cn: 根据检测到的源语言自动选择目标语言
zh_tw: 根據偵測到的來源語言自動選擇目標語言

source: Service Configuration
ar_sa: تكوين الخدمة
da_dk: Tjenestekonfiguration
de_de: Dienstkonfiguration
fr_fr: Configuration des services
hi_in: सेवा कॉन्फ़िगरेशन
id_id: Konfigurasi Layanan
it_it: Configurazione del servizio
ja_jp: サービス設定
ko_kr: 서비스 구성
ms_my: Konfigurasi Perkhidmatan
th_th: การกำหนดค่าบริการ
vi_vn: Cấu hình dịch vụ
zh_cn: 服务配置
zh_tw: 服務設定

# ServiceConfigurationDescription
source: Configure API keys, endpoints, and models for each translation service.
ar_sa: تكوين مفاتيح API والنقاط الطرفية والنماذج لكل خدمة ترجمة.
da_dk: Konfigurer API-nøgler, endpoints og modeller for hver oversættelsestjeneste.
de_de: Konfigurieren Sie API-Schlüssel, Endpunkte und Modelle für jeden Übersetzungsdienst.
fr_fr: Configurez les clés API, les points de terminaison et les modèles pour chaque service de traduction.
hi_in: प्रत्येक अनुवाद सेवा के लिए API key, endpoint और model कॉन्फ़िगर करें।
id_id: Konfigurasikan API key, endpoint, dan model untuk setiap layanan terjemahan.
it_it: Configura le chiavi API, gli endpoint e i modelli per ogni servizio di traduzione.
ja_jp: 各翻訳サービスのAPIキー、エンドポイント、モデルを設定します。
ko_kr: 각 번역 서비스에 대한 API 키, 엔드포인트 및 모델을 구성합니다.
ms_my: Konfigurasikan kunci API, endpoint dan model untuk setiap perkhidmatan terjemahan.
th_th: กำหนดค่า API key, endpoint และ model สำหรับแต่ละบริการแปลภาษา
vi_vn: Cấu hình API key, endpoint và model cho từng dịch vụ dịch thuật.
zh_cn: 为每个翻译服务配置 API 密钥、端点和模型。
zh_tw: 為每個翻譯服務設定 API 金鑰、端點和模型。

source: API Key
ar_sa: مفتاح API
da_dk: API-nøgle
de_de: API-Schlüssel
fr_fr: Clé API
it_it: Chiave API
ja_jp: APIキー
ko_kr: API 키
ms_my: Kunci API
zh_cn: API 密钥
zh_tw: API 金鑰

source: API Key (Optional)
ar_sa: مفتاح API (اختياري)
da_dk: API-nøgle (valgfri)
de_de: API-Schlüssel (Optional)
fr_fr: Clé API (optionnel)
hi_in: API Key (वैकल्पिक)
id_id: API Key (Opsional)
it_it: Chiave API (Opzionale)
ja_jp: APIキー（オプション）
ko_kr: API 키 (선택사항)
ms_my: Kunci API (Pilihan)
th_th: API Key (ไม่บังคับ)
vi_vn: API Key (Tùy chọn)
zh_cn: API 密钥（可选）
zh_tw: API 金鑰（選填）

source: Endpoint
ar_sa: نقطة الاتصال
de_de: Endpunkt
fr_fr: Point de terminaison
ja_jp: エンドポイント
ko_kr: 엔드포인트
zh_cn: 端点
zh_tw: 端點

source: Endpoint (Optional)
ar_sa: نقطة الاتصال (اختياري)
da_dk: Endpoint (valgfri)
de_de: Endpunkt (Optional)
fr_fr: Point de terminaison (optionnel)
hi_in: Endpoint (वैकल्पिक)
id_id: Endpoint (Opsional)
it_it: Endpoint (Opzionale)
ja_jp: エンドポイント（オプション）
ko_kr: 엔드포인트 (선택사항)
ms_my: Endpoint (Pilihan)
th_th: Endpoint (ไม่บังคับ)
vi_vn: Endpoint (Tùy chọn)
zh_cn: 端点（可选）
zh_tw: 端點（選填）

source: Endpoint (Required)
ar_sa: نقطة الاتصال (مطلوب)
da_dk: Endpoint (påkrævet)
de_de: Endpunkt (Erforderlich)
fr_fr: Point de terminaison (requis)
hi_in: Endpoint (आवश्यक)
id_id: Endpoint (Wajib)
it_it: Endpoint (Obbligatorio)
ja_jp: エンドポイント（必須）
ko_kr: 엔드포인트 (필수)
ms_my: Endpoint (Wajib)
th_th: Endpoint (จำเป็น)
vi_vn: Endpoint (Bắt buộc)
zh_cn: 端点（必填）
zh_tw: 端點（必填）

source: Model
ar_sa: النموذج
de_de: Modell
fr_fr: Modèle
it_it: Modello
ja_jp: モデル
ko_kr: 모델
zh_cn: 模型
zh_tw: 模型

source: Refresh
ar_sa: تحديث
da_dk: Opdater
de_de: Aktualisieren
fr_fr: Actualiser
hi_in: रीफ़्रेश
id_id: Segarkan
it_it: Aggiorna
ja_jp: 更新
ko_kr: 새로고침
ms_my: Muat Semula
th_th: รีเฟรช
vi_vn: Làm mới
zh_cn: 刷新
zh_tw: 重新整理
